Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.GetSizeInFloats
Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Returns:
The number of floats occupied by one vertex of this type.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Normal
The vertex's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs the vertex from a point and a normal vector.
position:
The vertex's position.
normal:
The vertex's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
A geometry vertex specified as a position in space with a normal vector.
Remarks:
Since these vertices do not have a color
their color is obtained from the Autodesk.Revit.DB.DirectContext3D.EffectInstance
Since:
2017